In [2]:
pip install pyMySql

Collecting pyMySql
  Using cached https://files.pythonhosted.org/packages/ed/39/15045ae46f2a123019aa968dfcba0396c161c20f855f11dea6796bcaae95/PyMySQL-0.9.3-py2.py3-none-any.whl
Installing collected packages: pyMySql
Successfully installed pyMySql-0.9.3
Note: you may need to restart the kernel to use updated packages.

In [12]:
import pandas as pd
import sqlalchemy as sa

engin=sa.create_engine('mysql+pymysql://root:Please@29@localhost:3306/testdatabase')

In [14]:
df=pd.read_sql_table('employee',engin)
df

   EMP_ID EMP_NAME        DOJ  DEPT_ID  STATUS
0       1    Vivek 2018-01-02        1  Active
1       2  Pradeep 2019-05-02        2  Active

In [15]:
df=pd.read_sql_table('employee',engin,columns=["EMP_NAME"])
df

  EMP_NAME
0    Vivek
1  Pradeep

In [17]:
df=pd.read_sql_query('Select * from employee',engin)
df

   EMP_ID EMP_NAME         DOJ  DEPT_ID  STATUS
0       1    Vivek  2018-01-02        1  Active
1       2  Pradeep  2019-05-02        2  Active

In [40]:
query_1 =''' 
     select * from employee
     inner join department 
     on employee.dept_id=department.dept_id
'''

In [41]:
df4=pd.read_sql_query(query_1,engin)
df4

   EMP_ID EMP_NAME         DOJ  DEPT_ID  STATUS  DEPT_ID   DEPT_NAME  STATUS
0       1    Vivek  2018-01-02        1  Active        1  Technology  Active
1       2  Pradeep  2019-05-02        2  Active        2     Finance  Active

In [47]:
pd.read_sql("employee",engin)

   EMP_ID EMP_NAME        DOJ  DEPT_ID  STATUS
0       1    Vivek 2018-01-02        1  Active
1       2  Pradeep 2019-05-02        2  Active

In [57]:
df5=pd.read_csv("C:\\Users\\kamit\\Desktop\\DataScience\\Panda\\emp.csv")
df5

    Name   Departmentid  Status
0   Rocky             2  Active
1  Nikhil             1  Active

In [61]:
df5.rename(columns={
    'Name ' : 'EMP_NAME',
    'Departmentid':'DEPT_ID',
    'Status':'STATUS'
},inplace=True)
df5

  EMP_NAME  DEPT_ID  STATUS
0    Rocky        2  Active
1   Nikhil        1  Active

In [63]:
df5.to_sql(
        name='employee',
        con=engin,
        if_exists='append',
        index=False
)